Repository: micw/OpenPhotoFrame
Catalog: lib/l10n/app_*.arb
Languages: de

source: Settings
de: Einstellungen

# sectionSlideshow
source: Slideshow
de: Diashow

source: Slide Duration
de: Anzeigedauer

source: Transition Duration
de: Überblendzeit

# unitSeconds
source: sec
de: Sek

# sectionClock
source: Clock
de: Uhr

source: Show Clock
de: Uhr anzeigen

# showClockSubtitle
source: Display time on slideshow
de: Uhrzeit auf der Diashow anzeigen

source: Size
de: Größe

# sectionPhotoInfo
source: Photo Information
de: Foto-Informationen

source: Show Photo Info
de: Foto-Info anzeigen

# showPhotoInfoSubtitle
source: Display date and location on slideshow
de: Datum und Ort auf der Diashow anzeigen

source: Use Script Font
de: Schreibschrift verwenden

# useScriptFontSubtitle
source: Display metadata in elegant handwritten style
de: Metadaten in eleganter Handschrift anzeigen

source: Resolve Location Names
de: Ortsnamen auflösen

# resolveLocationNamesSubtitle
source: Use OpenStreetMap to show place names instead of coordinates
de: OpenStreetMap nutzen um Ortsnamen statt Koordinaten anzuzeigen

# nominatimHint
source: Uses Nominatim (OpenStreetMap). No API key required.
de: Verwendet Nominatim (OpenStreetMap). Kein API-Schlüssel erforderlich.

# sectionPhotoSource
source: Photo Source
de: Fotoquelle

source: App Folder
de: App-Ordner

# appFolderSubtitle
source: Photos stored in app folder
de: Fotos im App-Ordner gespeichert

# appFolderWarning
source: Copy photos to this folder. They will be deleted when uninstalling the app.
de: Kopiere Fotos in diesen Ordner. Sie werden beim Deinstallieren der App gelöscht.

source: Device Photos
de: Geräte-Fotos

# devicePhotosSubtitle
source: Show photos from your device
de: Fotos vom Gerät anzeigen

source: Local Folder
de: Lokaler Ordner

# localFolderSubtitle
source: Use photos from a local folder
de: Fotos aus einem lokalen Ordner verwenden

# nextcloudSubtitle
source: Sync from Nextcloud public share link
de: Von Nextcloud öffentlichem Link synchronisieren

source: Loading...
de: Lädt...

source: Loading albums...
de: Alben werden geladen...

# tapToLoadAlbums
source: Tap to load device photo albums
de: Tippen um Fotoalben zu laden

source: Load
de: Laden

source: Photo Album
de: Fotoalbum

source: All Photos
de: Alle Fotos

source: Refresh albums
de: Alben aktualisieren

source: Change
de: Ändern

source: Reset
de: Zurücksetzen

source: Photo permission denied
de: Foto-Berechtigung verweigert

# errorLoadingAlbums
source: Error loading albums: {error}
de: Fehler beim Laden der Alben: {error}

# failedToPickFolder
source: Failed to pick folder: {error}
de: Ordnerauswahl fehlgeschlagen: {error}

source: Select Photo Folder
de: Foto-Ordner auswählen

source: Nextcloud Public Share URL
de: Nextcloud öffentlicher Freigabe-Link

source: Test Connection
de: Verbindung testen

source: Testing...
de: Teste...

source: Connection successful!
de: Verbindung erfolgreich!

source: Auto-Sync Interval
de: Auto-Sync-Intervall

source: Disabled
de: Deaktiviert

source: Delete orphaned files
de: Verwaiste Dateien löschen

# deleteOrphanedFilesSubtitle
source: Remove local files that are no longer on server
de: Lokale Dateien entfernen, die nicht mehr auf dem Server sind

source: Sync Now
de: Jetzt synchronisieren

source: Syncing...
de: Synchronisiere...

source: Sync completed successfully!
de: Synchronisation erfolgreich abgeschlossen!

# syncError
source: Error: {error}
de: Fehler: {error}

source: Never synced
de: Noch nie synchronisiert

source: Last sync: Just now
de: Letzte Sync: Gerade eben

# lastSyncMinutesAgo
source: Last sync: {minutes} min ago
de: Letzte Sync: vor {minutes} Min

# lastSyncHoursAgo
source: Last sync: {hours} hours ago
de: Letzte Sync: vor {hours} Stunden

source: Last sync: {date}
de: Letzte Sync: {date}

# sectionDisplaySchedule
source: Display Schedule
de: Anzeige-Zeitplan

source: Day/Night Schedule
de: Tag/Nacht-Zeitplan

# dayNightScheduleSubtitle
source: Turn off display at night
de: Display nachts ausschalten

source: Day starts at
de: Tag beginnt um

source: Night starts at
de: Nacht beginnt um

source: Native Screen Off
de: Natives Ausschalten

# nativeScreenOffEnabledSubtitle
source: Use Device Admin to completely turn off screen
de: Geräte-Admin verwenden um Bildschirm komplett auszuschalten

# nativeScreenOffDisabledSubtitle
source: Requires Device Admin permission
de: Erfordert Geräte-Admin-Berechtigung

# deviceAdminExplanation
source: Device Admin permission is required to fully turn off the screen. Without it, the display will only be dimmed.
de: Die Geräte-Admin-Berechtigung wird benötigt, um den Bildschirm vollständig auszuschalten. Ohne sie wird das Display nur gedimmt.

source: Grant Device Admin
de: Geräte-Admin gewähren

# deviceAdminEnabled
source: Device Admin enabled - screen will turn off completely
de: Geräte-Admin aktiviert - Bildschirm wird komplett ausgeschaltet

# screenLockWarning
source: Important: Screen lock (PIN/Pattern/Password) must be disabled for automatic wake-up to work. Go to Settings → Security → Screen lock → None.
de: Wichtig: Die Bildschirmsperre (PIN/Muster/Passwort) muss deaktiviert sein, damit das automatische Aufwachen funktioniert. Gehe zu Einstellungen → Sicherheit → Bildschirmsperre → Keine.

source: Device Admin Active
de: Geräte-Admin aktiv

# deviceAdminUninstallWarning
source: To uninstall this app, you must first disable Device Admin permission in Android settings.
de: Um diese App zu deinstallieren, muss zuerst die Geräte-Admin-Berechtigung in den Android-Einstellungen deaktiviert werden.

source: Open Device Admin Settings
de: Geräte-Admin-Einstellungen öffnen

source: Start on Boot
de: Bei Start öffnen

# startOnBootSubtitle
source: Automatically start app when device boots
de: App automatisch beim Gerätestart öffnen

source: Keep App Running
de: App am Laufen halten

# keepAppRunningSubtitle
source: Prevent app from being stopped on low memory
de: Verhindern, dass die App bei wenig Speicher beendet wird

# notificationPermissionRequired
source: Notification permission is required for Keep App Running
de: Benachrichtigungs-Berechtigung wird für 'App am Laufen halten' benötigt

# keepAliveDialogTitle
source: Keep App Running
de: App am Laufen halten

# keepAliveWhatDoes
source: What does this do?
de: Was macht diese Funktion?

# keepAliveWhatDoesExplanation
source: This feature keeps the photo frame app running continuously, even when the device is low on memory.
de: Diese Funktion hält die Bilderrahmen-App dauerhaft am Laufen, auch wenn das Gerät wenig Arbeitsspeicher hat.

# keepAliveWhyNeed
source: Why would I need this?
de: Wofür brauche ich das?

# keepAliveWhyNeedExplanation
source: On older devices with limited RAM, Android may stop the app to free up memory. This prevents that by running the app as a foreground service.
de: Auf älteren Geräten mit wenig RAM kann Android die App beenden, um Speicher freizugeben. Dies verhindert das, indem die App als Vordergrunddienst läuft.

# keepAliveWhatHappens
source: What will happen?
de: Was passiert dann?

# keepAliveWhatHappensExplanation
source: • A small notification will appear in the status bar • The app will be less likely to be stopped by Android • On Android 13+, you'll need to grant notification permission
de: • Eine kleine Benachrichtigung erscheint in der Statusleiste • Die App wird weniger wahrscheinlich von Android beendet • Ab Android 13 musst du die Benachrichtigungs-Berechtigung erteilen

# keepAliveDisableAnytime
source: You can disable this at any time from the settings.
de: Du kannst dies jederzeit in den Einstellungen deaktivieren.

source: Cancel
de: Abbrechen

source: Enable
de: Aktivieren

source: About
de: Über

source: No photos found
de: Keine Fotos gefunden

# tapCenterToOpenSettings
source: Tap center of screen to open settings
de: Tippe auf die Bildschirmmitte um Einstellungen zu öffnen

source: Screen Orientation
de: Bildschirmausrichtung

# screenOrientationAuto
source: Automatic (Sensor)
de: Automatisch (Sensor)

# screenOrientationPortraitUp
source: Portrait
de: Hochformat

# screenOrientationPortraitDown
source: Portrait (upside down)
de: Hochformat (auf dem Kopf)

# screenOrientationLandscapeLeft
source: Landscape (left)
de: Querformat (links)

# screenOrientationLandscapeRight
source: Landscape (right)
de: Querformat (rechts)
